{"id":"paper_2025080500001","title":"GitHub is an effective platform for collaborative and reproducible laboratory research","authors":"Katharine Y. Chen, Maria Toro-Moreno, Arvind Rasi Subramaniam","journal":"arXiv","year":"2024","doi":"10.48550/arXiv.2408.09344","url":"https://arxiv.org/abs/2408.09344","keyAssumptions":"Version control systems are primarily for software development; Scientific research requires specialized collaboration tools; Git workflows are too technical for researchers","citation":"Chen, K. Y., Toro-Moreno, M., & Subramaniam, A. R. (2024). GitHub is an effective platform for collaborative and reproducible laboratory research. arXiv preprint arXiv:2408.09344.","notes":"Demonstrates adaptation of software development workflows to laboratory research lifecycle management. Provides three-step framework: experiment organization via issues/boards, documentation with version control, reproducible environments with containers.","addedDate":"2025-08-05T22:11:00Z"}
{"id":"paper_2025080500002","title":"An open framework for archival, reproducible, and transparent science","authors":"Sabar Dasgupta, Paul Nuyujukian","journal":"arXiv","year":"2024","doi":"10.48550/arXiv.2504.08171","url":"https://arxiv.org/abs/2504.08171","keyAssumptions":"Making data and code available is sufficient for reproducibility; Computational environments can be described in text; Static archives are adequate for preservation","citation":"Dasgupta, S., & Nuyujukian, P. (2024). An open framework for archival, reproducible, and transparent science. arXiv preprint arXiv:2504.08171.","notes":"ARTS framework integrates containers, version control, and persistent archives. Addresses reproducibility crisis by preserving complete computational contexts, not just data and code.","addedDate":"2025-08-05T22:11:00Z"}
{"id":"paper_2025080500003","title":"AgentRxiv: Towards Collaborative Autonomous Research","authors":"Samuel Schmidgall et al.","journal":"arXiv","year":"2025","doi":"10.48550/arXiv.2503.18102","url":"https://arxiv.org/abs/2503.18102","keyAssumptions":"AI research agents should work independently; Scientific collaboration requires human mediation; AI agents cannot build upon each other's work","citation":"Schmidgall, S., et al. (2025). AgentRxiv: Towards Collaborative Autonomous Research. arXiv preprint arXiv:2503.18102.","notes":"Framework enabling AI agent collaboration through shared preprint server. Demonstrates 11.4% performance improvement when agents access prior research vs isolation. Shows potential for AI-AI research collaboration.","addedDate":"2025-08-05T22:11:00Z"}
{"id":"paper_2025080500004","title":"Procedural Knowledge Libraries: Towards Executable (Research) Memory","authors":"Hamidah Oderinwale et al.","journal":"arXiv","year":"2025","doi":"10.48550/arXiv.2506.14715","url":"https://arxiv.org/abs/2506.14715","keyAssumptions":"Research outputs are primary valuable artifacts; Research processes are too complex to capture; Static documentation is sufficient","citation":"Oderinwale, H., et al. (2025). Procedural Knowledge Libraries: Towards Executable (Research) Memory. arXiv preprint arXiv:2506.14715.","notes":"PKL framework captures complete research processes including failures, decisions, iterations. Proposes executable memory for research beyond static outcomes. Extends version control to decision-making rationales.","addedDate":"2025-08-05T22:11:00Z"}
{"id":"paper_2025080500005","title":"Managing Software Provenance to Enhance Reproducibility in Computational Research","authors":"Akash Dhruv, Anshu Dubey","journal":"arXiv","year":"2023","doi":"10.48550/arXiv.2308.15637","url":"https://arxiv.org/abs/2308.15637","keyAssumptions":"Individual researchers can adequately manage computational experiment documentation; HPC complexity makes systematic documentation impractical","citation":"Dhruv, A., & Dubey, A. (2023). Managing Software Provenance to Enhance Reproducibility in Computational Research. arXiv preprint arXiv:2308.15637.","notes":"Systematic provenance tracking for HPC computational experiments. Demonstrates feasibility of comprehensive documentation in complex computing environments. Addresses scientific computing reproducibility challenges.","addedDate":"2025-08-05T22:11:00Z"}
{"id":"paper_2025080500006","title":"How Scientists Use Jupyter Notebooks: Goals, Quality Attributes, and Opportunities","authors":"Ruanqianqian (Lisa) Huang et al.","journal":"arXiv","year":"2025","doi":"10.48550/arXiv.2503.12309","url":"https://arxiv.org/abs/2503.12309","keyAssumptions":"Scientists primarily use notebooks for linear exploration; Notebook design requirements are well-understood; Scientists' practices mirror professional developers","citation":"Huang, R. L., et al. (2025). How Scientists Use Jupyter Notebooks: Goals, Quality Attributes, and Opportunities. arXiv preprint arXiv:2503.12309.","notes":"Observational study of 20 scientists using Jupyter notebooks. Reveals goal-dependent quality priorities, state management challenges, and need for sophisticated dependency tracking. Informs version control requirements for scientific workflows.","addedDate":"2025-08-05T22:11:00Z"}